# Pandas start 5-10-19

In [1]:
import pandas as pd

In [4]:
obj = pd.Series([1,2,3,4,5])
obj

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
obj.index

RangeIndex(start=0, stop=5, step=1)

In [9]:
obj1 = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
obj1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [10]:
obj1['c'] = 0

In [11]:
obj1

a    1
b    2
c    0
d    4
e    5
dtype: int64

In [13]:
obj2 = pd.Series(["apple","banana","orange","grapes"," peach"],index= [1,2,3,4,5])
obj2

1     apple
2    banana
3    orange
4    grapes
5     peach
dtype: object

In [14]:
obj2[2] = 2
obj2

1     apple
2         2
3    orange
4    grapes
5     peach
dtype: object

In [15]:
del obj2[2]
obj2

1     apple
3    orange
4    grapes
5     peach
dtype: object

In [16]:
obj2[2] = "banana"
obj2

1     apple
3    orange
4    grapes
5     peach
2    banana
dtype: object

In [19]:
obj2[2] = "2 bananas"

In [20]:
obj2

1        apple
3       orange
4       grapes
5        peach
2    2 bananas
dtype: object

In [21]:
obj2[[1,2,3,4]]

1        apple
2    2 bananas
3       orange
4       grapes
dtype: object

In [22]:
obj2 == "grapes"

1    False
3    False
4     True
5    False
2    False
dtype: bool

In [24]:
obj2[obj2=="apple"]

1    apple
dtype: object

In [25]:
obj2*obj1

1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
a    NaN
b    NaN
c    NaN
d    NaN
e    NaN
dtype: object

In [33]:
obj2 * 3

1                appleappleapple
3             orangeorangeorange
4             grapesgrapesgrapes
5              peach peach peach
2    2 bananas2 bananas2 bananas
dtype: object

In [34]:
print(obj2[2]*3)

2 bananas2 bananas2 bananas

In [35]:
sdata = {'karachi':3,'lahore':1,'quetta':2}
sdata

{'karachi': 3, 'lahore': 1, 'quetta': 2}

In [36]:
series = pd.Series(sdata)
series

karachi    3
lahore     1
quetta     2
dtype: int64

In [49]:
states = ['karachi','lahore',"islamabad"]
states

['karachi', 'lahore', 'islamabad']

In [50]:
adata = [5,2,3,0]
series2 = pd.Series(sdata,index=states)

In [51]:
series2

karachi      3.0
lahore       1.0
islamabad    NaN
dtype: float64

In [52]:
df = pd.DataFrame(series2)
df

             0
karachi    3.0
lahore     1.0
islamabad  NaN

In [53]:
data={'state':['khi','lhr','phsr','isb','khi'],
    'year':[2001,2002,2003,2004,2005],
      'pop':[200,150,180,95,202]
     }
data

{'state': ['khi', 'lhr', 'phsr', 'isb', 'khi'],
 'year': [2001, 2002, 2003, 2004, 2005],
 'pop': [200, 150, 180, 95, 202]}

In [62]:
df1 = pd.DataFrame(sdata,index=series)
df2 = pd.DataFrame(data)
df1

   karachi  lahore  quetta
3        3       1       2
1        3       1       2
2        3       1       2

In [61]:

series

karachi    3
lahore     1
quetta     2
dtype: int64

In [60]:
sdata

{'karachi': 3, 'lahore': 1, 'quetta': 2}

In [64]:
df2

  state  year  pop
0   khi  2001  200
1   lhr  2002  150
2  phsr  2003  180
3   isb  2004   95
4   khi  2005  202

In [69]:
df2.head(1)

  state  year  pop
0   khi  2001  200

In [72]:
df2.info

<bound method DataFrame.info of   state  year  pop
0   khi  2001  200
1   lhr  2002  150
2  phsr  2003  180
3   isb  2004   95
4   khi  2005  202>

In [73]:
df2.describe

<bound method NDFrame.describe of   state  year  pop
0   khi  2001  200
1   lhr  2002  150
2  phsr  2003  180
3   isb  2004   95
4   khi  2005  202>

In [75]:
df2

  state  year  pop
0   khi  2001  200
1   lhr  2002  150
2  phsr  2003  180
3   isb  2004   95
4   khi  2005  202

In [78]:
df3 = pd.DataFrame(data, columns=['pop','year','state','dept'],index=['a','b','c','d','e'])
df3['dept']=[100,200,30,400,100]

In [79]:
df3

   pop  year state  dept
a  200  2001   khi   100
b  150  2002   lhr   200
c  180  2003  phsr    30
d   95  2004   isb   400
e  202  2005   khi   100

In [80]:
df3.year

a    2001
b    2002
c    2003
d    2004
e    2005
Name: year, dtype: int64

In [82]:
df3.iloc[3]

pop        95
year     2004
state     isb
dept      400
Name: d, dtype: object

In [ ]:
f1 = pd.DataFrame

In [87]:
student = pd.Series(['Ali','Usman','Ahmed','Hamza','Usman'])
marks1=pd.Series([90,87,72,89,56])
marks2=pd.Series([82,91,75,85,67])

In [89]:
marks = pd.DataFrame([student,marks1,marks2],columns=['Name',"Quiz 1","Quiz 2"])

In [90]:
marks

   Name  Quiz 1  Quiz 2
0   NaN     NaN     NaN
1   NaN     NaN     NaN
2   NaN     NaN     NaN

In [91]:
markD = ("name": student,
        'marks1':marks1
        )

SyntaxError: invalid syntax (<ipython-input-91-3adeb47e84f6>, line 1)